In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.random.randn(9),index = [['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [4]:
data

a  1   -0.830441
   2   -0.787258
   3   -0.353565
b  1    0.329550
   3    0.315520
c  1    0.532982
   2    1.878732
d  2    0.337453
   3    1.547598
dtype: float64

In [9]:
data['b':'c']

b  1    0.329550
   3    0.315520
c  1    0.532982
   2    1.878732
dtype: float64

In [7]:
data.loc[:,2] # Series데이터이지만 index가 2중이므로 슬라이싱 2차원처럼함.ㅠ

a   -0.787258
c    1.878732
d    0.337453
dtype: float64

In [15]:
sTest = data.unstack() # stack을 풀어줄때 사용함 순서쌍으로 맞추어준다.

In [16]:
sTest.stack() #위에서 unstack했던걸 복구시킴

a  1   -0.830441
   2   -0.787258
   3   -0.353565
b  1    0.329550
   3    0.315520
c  1    0.532982
   2    1.878732
d  2    0.337453
   3    1.547598
dtype: float64

In [18]:
frame = pd.DataFrame(np.arange(12).reshape(4,3), index = [['a','a','b','b'],[1,2,1,2]],
                    columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [20]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [21]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [22]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [23]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [24]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [26]:
frame.sum(level='key2')

<ipython-input-26-f3eb061baf48>:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [27]:
frame.sum(level='color', axis=1)

<ipython-input-27-7f534aeea1c3>:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [29]:
frame = pd.DataFrame({'a':range(7), 'b':range(7,0,-1),
                     'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [30]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [31]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [32]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [40]:
df1= pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                  'data1':range(7)})
df2= pd.DataFrame({'key':['a','b','d'],
                  'data2':range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [42]:
pd.merge(df1, df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [43]:
df3= pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                  'data1':range(7)})
df4= pd.DataFrame({'rkey':['a','b','d'],
                  'data2':range(3)})

In [46]:
pd.merge(df3, df4, left_on='lkey', right_on="rkey", how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [47]:
pd.merge(df3, df4, left_on='lkey', right_on="rkey", how='left')

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [48]:
pd.merge(df3, df4, left_on='lkey', right_on="rkey", how='right')

  lkey  data1 rkey  data2
0    a    2.0    a      0
1    a    4.0    a      0
2    a    5.0    a      0
3    b    0.0    b      1
4    b    1.0    b      1
5    b    6.0    b      1
6  NaN    NaN    d      2

In [45]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [50]:
arr = np.arange(12).reshape(3,4)

In [54]:
np.concatenate([arr,arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [55]:
np.concatenate([arr,arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [56]:
s1 = pd.Series([0,1], index=['a','b'])
s2 = pd.Series([2,3,4], index=['c','d','e'])
s3 = pd.Series([5,6], index=['f','g'])

In [57]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [58]:
pd.concat([s1,s2,s3], axis = 1) #없으면 만들어서 이어붙인다.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [59]:
s4 = pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [61]:
pd.concat([s1,s4], axis=1, join = 'inner') #inner 은 교집합이다

   0  1
a  0  0
b  1  1

In [67]:
result = pd.concat([s1,s2,s3], keys=['one','two','three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [65]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [73]:
result = pd.concat([s1,s2,s3], keys=['one','two','three'],axis=1)
result

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [84]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'], columns=['one','two'])
df2 = pd.DataFrame(np.arange(4).reshape(2,2), index=['a','c'], columns=['three','four'])

In [76]:
pd.concat([df1,df2])

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    0.0   1.0
c  NaN  NaN    2.0   3.0

In [88]:
pd.concat([df1,df2],axis=1 ,keys=['level1','level2'], names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    0.0  1.0
b          2   3    NaN  NaN
c          4   5    2.0  3.0

In [89]:
pd.concat([df1,df2],ignore_index=True)

   one  two  three  four
0  0.0  1.0    NaN   NaN
1  2.0  3.0    NaN   NaN
2  4.0  5.0    NaN   NaN
3  NaN  NaN    0.0   1.0
4  NaN  NaN    2.0   3.0

In [90]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.138398  0.670701
1    a  two -0.875877 -0.015704
2    b  one -0.070926  0.274423
3    b  two  0.400114 -1.903360
4    a  one  0.586022 -1.761280

In [96]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [99]:
grouped.max()

key1
a    0.586022
b    0.400114
Name: data1, dtype: float64

In [102]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     0.362210
      two    -0.875877
b     one    -0.070926
      two     0.400114
Name: data1, dtype: float64

In [103]:
means.unstack()

key2       one       two
key1
a     0.362210 -0.875877
b    -0.070926  0.400114

In [104]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [107]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.875877
            2006   -0.070926
Ohio        2005    0.269256
            2006    0.586022
Name: data1, dtype: float64

In [108]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.050486 -0.368761
b     0.164594 -0.814468

In [109]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.362210 -0.545290
     two  -0.875877 -0.015704
b    one  -0.070926  0.274423
     two   0.400114 -1.903360

In [110]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [113]:
z = df.groupby('key1')
z.mean()

         data1     data2
key1
a    -0.050486 -0.368761
b     0.164594 -0.814468

In [111]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.138398  0.670701
1    a  two -0.875877 -0.015704
4    a  one  0.586022 -1.761280
b
  key1 key2     data1     data2
2    b  one -0.070926  0.274423
3    b  two  0.400114 -1.903360

In [114]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.138398  0.670701
4    a  one  0.586022 -1.761280
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.875877 -0.015704
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.070926  0.274423
('b', 'two')
  key1 key2     data1    data2
3    b  two  0.400114 -1.90336

In [115]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -0.070926  0.274423
3    b  two  0.400114 -1.903360

In [116]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [117]:
grouped = df.groupby(df.dtypes, axis =1)

In [119]:
for i,j in grouped:
    print(i,'\n',j)

float64
       data1     data2
0  0.138398  0.670701
1 -0.875877 -0.015704
2 -0.070926  0.274423
3  0.400114 -1.903360
4  0.586022 -1.761280
object
   key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [120]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [121]:
people

               a         b         c         d         e
Joe    -0.190039 -0.338635  1.573136  0.883483  0.697204
Steve  -0.575077  0.397139  0.194370 -0.670078  1.286553
Wes    -1.008238  0.824700  0.717209  0.453768 -0.767665
Jim     0.762232 -1.589029 -0.199055  1.090412  1.163518
Travis  0.493001  0.172362 -0.148311  1.474304  1.238520

In [122]:
people.iloc[2:3, [1, 2]] = np.nan 
people

               a         b         c         d         e
Joe    -0.190039 -0.338635  1.573136  0.883483  0.697204
Steve  -0.575077  0.397139  0.194370 -0.670078  1.286553
Wes    -1.008238       NaN       NaN  0.453768 -0.767665
Jim     0.762232 -1.589029 -0.199055  1.090412  1.163518
Travis  0.493001  0.172362 -0.148311  1.474304  1.238520

In [123]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [124]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     2.456618  0.168531
Steve  -0.475709  1.108615
Wes     0.453768 -1.775904
Jim     0.891357  0.336721
Travis  1.325993  1.903884

In [125]:
map_series= pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [126]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [127]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     2.456618  0.168531
Steve  -0.475709  1.108615
Wes     0.453768 -1.775904
Jim     0.891357  0.336721
Travis  1.325993  1.903884

In [130]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9) #quantile(0.5)는 중앙값 처럼 그 값의 비율에 해당하는 값 반환

key1
a    0.496497
b    0.353010
Name: data1, dtype: float64

In [131]:
def peak_to_peak(arr):
    return arr.max()- arr.min()
grouped.agg(peak_to_peak)

C:\Users\korea\anaconda3\envs\da\lib\site-packages\pandas\core\groupby\generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

         data1     data2
key1
a     1.461898  2.431982
b     0.471040  2.177783

In [132]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.050486  0.749029 -0.875877 -0.368740  0.138398  0.362210
b      2.0  0.164594  0.333076 -0.070926  0.046834  0.164594  0.282354

               data2                                                   \
           max count      mean       std      min       25%       50%
key1
a     0.586022   3.0 -0.368761  1.253842 -1.76128 -0.888492 -0.015704
b     0.400114   2.0 -0.814468  1.539925 -1.90336 -1.358914 -0.814468


           75%       max
key1
a     0.327499  0.670701
b    -0.270023  0.274423